dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxSpu_bf.h
/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN26 */
#define IFX_SPU_ACCEN0_EN26_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN26 */
#define IFX_SPU_ACCEN0_EN26_OFF (26u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN27 */
#define IFX_SPU_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN27 */
#define IFX_SPU_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN27 */
#define IFX_SPU_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN28 */
#define IFX_SPU_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN28 */
#define IFX_SPU_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN28 */
#define IFX_SPU_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN29 */
#define IFX_SPU_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN29 */
#define IFX_SPU_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN29 */
#define IFX_SPU_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN30 */
#define IFX_SPU_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN30 */
#define IFX_SPU_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN30 */
#define IFX_SPU_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_SPU_ACCEN0_Bits.EN31 */
#define IFX_SPU_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_SPU_ACCEN0_Bits.EN31 */
#define IFX_SPU_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ACCEN0_Bits.EN31 */
#define IFX_SPU_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_SPU_OCS_Bits.TGS */
#define IFX_SPU_OCS_TGS_LEN (2u)

/** \brief Mask for Ifx_SPU_OCS_Bits.TGS */
#define IFX_SPU_OCS_TGS_MSK (0x3u)

/** \brief Offset for Ifx_SPU_OCS_Bits.TGS */
#define IFX_SPU_OCS_TGS_OFF (0u)

/** \brief Length for Ifx_SPU_OCS_Bits.TGB */
#define IFX_SPU_OCS_TGB_LEN (1u)

/** \brief Mask for Ifx_SPU_OCS_Bits.TGB */
#define IFX_SPU_OCS_TGB_MSK (0x1u)

/** \brief Offset for Ifx_SPU_OCS_Bits.TGB */
#define IFX_SPU_OCS_TGB_OFF (2u)

/** \brief Length for Ifx_SPU_OCS_Bits.TG_P */
#define IFX_SPU_OCS_TG_P_LEN (1u)

/** \brief Mask for Ifx_SPU_OCS_Bits.TG_P */
#define IFX_SPU_OCS_TG_P_MSK (0x1u)

/** \brief Offset for Ifx_SPU_OCS_Bits.TG_P */
#define IFX_SPU_OCS_TG_P_OFF (3u)

/** \brief Length for Ifx_SPU_OCS_Bits.SUS */
#define IFX_SPU_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_SPU_OCS_Bits.SUS */
#define IFX_SPU_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_SPU_OCS_Bits.SUS */
#define IFX_SPU_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_SPU_OCS_Bits.SUS_P */
#define IFX_SPU_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_SPU_OCS_Bits.SUS_P */
#define IFX_SPU_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_SPU_OCS_Bits.SUS_P */
#define IFX_SPU_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_SPU_OCS_Bits.SUSSTA */
#define IFX_SPU_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_SPU_OCS_Bits.SUSSTA */
#define IFX_SPU_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_SPU_OCS_Bits.SUSSTA */
#define IFX_SPU_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_SPU_ODA_Bits.DDREN */
#define IFX_SPU_ODA_DDREN_LEN (1u)

/** \brief Mask for Ifx_SPU_ODA_Bits.DDREN */
#define IFX_SPU_ODA_DDREN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ODA_Bits.DDREN */
#define IFX_SPU_ODA_DDREN_OFF (0u)

/** \brief Length for Ifx_SPU_ODA_Bits.DREN */
#define IFX_SPU_ODA_DREN_LEN (1u)

/** \brief Mask for Ifx_SPU_ODA_Bits.DREN */
#define IFX_SPU_ODA_DREN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_ODA_Bits.DREN */
#define IFX_SPU_ODA_DREN_OFF (1u)

/** \brief Length for Ifx_SPU_KRST0_Bits.RST */
#define IFX_SPU_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_SPU_KRST0_Bits.RST */
#define IFX_SPU_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_SPU_KRST0_Bits.RST */
#define IFX_SPU_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_SPU_KRST0_Bits.RSTSTAT */
#define IFX_SPU_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_SPU_KRST0_Bits.RSTSTAT */
#define IFX_SPU_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_SPU_KRST0_Bits.RSTSTAT */
#define IFX_SPU_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_SPU_KRST1_Bits.RST */
#define IFX_SPU_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_SPU_KRST1_Bits.RST */
#define IFX_SPU_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_SPU_KRST1_Bits.RST */
#define IFX_SPU_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_SPU_KRSTCLR_Bits.CLR */
#define IFX_SPU_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_SPU_KRSTCLR_Bits.CLR */
#define IFX_SPU_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_SPU_KRSTCLR_Bits.CLR */
#define IFX_SPU_KRSTCLR_CLR_OFF (0u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXSPU_BF_H */
